###################################################################

# Created by write_sdc on Fri Aug 12 04:01:16 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -max_library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -min scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -min_library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c
set_wire_load_model -name tsmc13_wl30 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {A[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {B[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {ALU_FUNC[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {ALU_FUNC[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {ALU_FUNC[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {ALU_FUNC[0]}]
set_load -pin_load 75 [get_ports {Arith_OUT[15]}]
set_load -pin_load 75 [get_ports {Arith_OUT[14]}]
set_load -pin_load 75 [get_ports {Arith_OUT[13]}]
set_load -pin_load 75 [get_ports {Arith_OUT[12]}]
set_load -pin_load 75 [get_ports {Arith_OUT[11]}]
set_load -pin_load 75 [get_ports {Arith_OUT[10]}]
set_load -pin_load 75 [get_ports {Arith_OUT[9]}]
set_load -pin_load 75 [get_ports {Arith_OUT[8]}]
set_load -pin_load 75 [get_ports {Arith_OUT[7]}]
set_load -pin_load 75 [get_ports {Arith_OUT[6]}]
set_load -pin_load 75 [get_ports {Arith_OUT[5]}]
set_load -pin_load 75 [get_ports {Arith_OUT[4]}]
set_load -pin_load 75 [get_ports {Arith_OUT[3]}]
set_load -pin_load 75 [get_ports {Arith_OUT[2]}]
set_load -pin_load 75 [get_ports {Arith_OUT[1]}]
set_load -pin_load 75 [get_ports {Arith_OUT[0]}]
set_load -pin_load 75 [get_ports Carry_OUT]
set_load -pin_load 75 [get_ports Arith_Flag]
set_load -pin_load 75 [get_ports {Logic_OUT[7]}]
set_load -pin_load 75 [get_ports {Logic_OUT[6]}]
set_load -pin_load 75 [get_ports {Logic_OUT[5]}]
set_load -pin_load 75 [get_ports {Logic_OUT[4]}]
set_load -pin_load 75 [get_ports {Logic_OUT[3]}]
set_load -pin_load 75 [get_ports {Logic_OUT[2]}]
set_load -pin_load 75 [get_ports {Logic_OUT[1]}]
set_load -pin_load 75 [get_ports {Logic_OUT[0]}]
set_load -pin_load 75 [get_ports Logic_Flag]
set_load -pin_load 75 [get_ports {Shift_OUT[7]}]
set_load -pin_load 75 [get_ports {Shift_OUT[6]}]
set_load -pin_load 75 [get_ports {Shift_OUT[5]}]
set_load -pin_load 75 [get_ports {Shift_OUT[4]}]
set_load -pin_load 75 [get_ports {Shift_OUT[3]}]
set_load -pin_load 75 [get_ports {Shift_OUT[2]}]
set_load -pin_load 75 [get_ports {Shift_OUT[1]}]
set_load -pin_load 75 [get_ports {Shift_OUT[0]}]
set_load -pin_load 75 [get_ports Shift_Flag]
set_load -pin_load 75 [get_ports {CMP_OUT[2]}]
set_load -pin_load 75 [get_ports {CMP_OUT[1]}]
set_load -pin_load 75 [get_ports {CMP_OUT[0]}]
set_load -pin_load 75 [get_ports CMP_Flag]
create_clock [get_ports CLK]  -period 100  -waveform {0 50}
set_clock_latency 0  [get_clocks CLK]
set_clock_uncertainty -setup 0.2  [get_clocks CLK]
set_clock_uncertainty -hold 0.1  [get_clocks CLK]
set_clock_transition -min -fall 0.05 [get_clocks CLK]
set_clock_transition -max -fall 0.05 [get_clocks CLK]
set_clock_transition -min -rise 0.05 [get_clocks CLK]
set_clock_transition -max -rise 0.05 [get_clocks CLK]
set_input_delay -clock CLK  20  [get_ports {A[7]}]
set_input_delay -clock CLK  20  [get_ports {A[6]}]
set_input_delay -clock CLK  20  [get_ports {A[5]}]
set_input_delay -clock CLK  20  [get_ports {A[4]}]
set_input_delay -clock CLK  20  [get_ports {A[3]}]
set_input_delay -clock CLK  20  [get_ports {A[2]}]
set_input_delay -clock CLK  20  [get_ports {A[1]}]
set_input_delay -clock CLK  20  [get_ports {A[0]}]
set_input_delay -clock CLK  20  [get_ports {B[7]}]
set_input_delay -clock CLK  20  [get_ports {B[6]}]
set_input_delay -clock CLK  20  [get_ports {B[5]}]
set_input_delay -clock CLK  20  [get_ports {B[4]}]
set_input_delay -clock CLK  20  [get_ports {B[3]}]
set_input_delay -clock CLK  20  [get_ports {B[2]}]
set_input_delay -clock CLK  20  [get_ports {B[1]}]
set_input_delay -clock CLK  20  [get_ports {B[0]}]
set_input_delay -clock CLK  20  [get_ports {ALU_FUNC[3]}]
set_input_delay -clock CLK  20  [get_ports {ALU_FUNC[2]}]
set_input_delay -clock CLK  20  [get_ports {ALU_FUNC[1]}]
set_input_delay -clock CLK  20  [get_ports {ALU_FUNC[0]}]
set_output_delay -clock CLK  20  [get_ports CMP_Flag]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[15]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[14]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[13]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[12]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[11]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[10]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[9]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[8]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[7]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[6]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[5]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[4]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[3]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[2]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[1]}]
set_output_delay -clock CLK  20  [get_ports {Arith_OUT[0]}]
set_output_delay -clock CLK  20  [get_ports Carry_OUT]
set_output_delay -clock CLK  20  [get_ports Arith_Flag]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[7]}]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[6]}]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[5]}]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[4]}]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[3]}]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[2]}]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[1]}]
set_output_delay -clock CLK  20  [get_ports {Logic_OUT[0]}]
set_output_delay -clock CLK  20  [get_ports Logic_Flag]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[7]}]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[6]}]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[5]}]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[4]}]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[3]}]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[2]}]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[1]}]
set_output_delay -clock CLK  20  [get_ports {Shift_OUT[0]}]
set_output_delay -clock CLK  20  [get_ports Shift_Flag]
set_output_delay -clock CLK  20  [get_ports {CMP_OUT[2]}]
set_output_delay -clock CLK  20  [get_ports {CMP_OUT[1]}]
set_output_delay -clock CLK  20  [get_ports {CMP_OUT[0]}]

