###################################################################

# Created by write_sdc on Sat Aug 3 03:45:38 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -max_library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -min scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -min_library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c
set_wire_load_model -name tsmc13_wl30 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[15]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[14]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[13]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[12]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[11]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[10]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[9]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[8]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[7]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[6]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[5]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[4]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[3]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[2]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[1]}]
set_driving_cell -lib_cell BUFX6M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Signal_Noise[0]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[15]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[14]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[13]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[12]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[11]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[10]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[9]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[8]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[7]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[6]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[5]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[4]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[3]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[2]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[1]}]
set_load -pin_load 0.5 [get_ports {Fliter_Signal[0]}]
create_clock [get_ports CLK]  -period 100  -waveform {0 50}
set_clock_latency 0  [get_clocks CLK]
set_clock_uncertainty -setup 0.25  [get_clocks CLK]
set_clock_uncertainty -hold 0.05  [get_clocks CLK]
set_clock_transition -min -fall 0.1 [get_clocks CLK]
set_clock_transition -max -fall 0.1 [get_clocks CLK]
set_clock_transition -min -rise 0.1 [get_clocks CLK]
set_clock_transition -max -rise 0.1 [get_clocks CLK]
group_path -name INOUT  -from [list [get_ports CLK] [get_ports {Signal_Noise[15]}] [get_ports {Signal_Noise[14]}] [get_ports {Signal_Noise[13]}] [get_ports {Signal_Noise[12]}] [get_ports {Signal_Noise[11]}] [get_ports {Signal_Noise[10]}] [get_ports {Signal_Noise[9]}] [get_ports {Signal_Noise[8]}] [get_ports {Signal_Noise[7]}] [get_ports {Signal_Noise[6]}] [get_ports {Signal_Noise[5]}] [get_ports {Signal_Noise[4]}] [get_ports {Signal_Noise[3]}] [get_ports {Signal_Noise[2]}] [get_ports {Signal_Noise[1]}] [get_ports {Signal_Noise[0]}] [get_ports SI] [get_ports SE] [get_ports test_mode] [get_ports scan_clk] [get_ports scan_rst]]  -to [list [get_ports {Fliter_Signal[15]}] [get_ports {Fliter_Signal[14]}] [get_ports {Fliter_Signal[13]}] [get_ports {Fliter_Signal[12]}] [get_ports {Fliter_Signal[11]}] [get_ports {Fliter_Signal[10]}] [get_ports {Fliter_Signal[9]}] [get_ports {Fliter_Signal[8]}] [get_ports {Fliter_Signal[7]}] [get_ports {Fliter_Signal[6]}] [get_ports {Fliter_Signal[5]}] [get_ports {Fliter_Signal[4]}] [get_ports {Fliter_Signal[3]}] [get_ports {Fliter_Signal[2]}] [get_ports {Fliter_Signal[1]}] [get_ports {Fliter_Signal[0]}] [get_ports SO]]
group_path -name INREG  -from [list [get_ports CLK] [get_ports {Signal_Noise[15]}] [get_ports {Signal_Noise[14]}] [get_ports {Signal_Noise[13]}] [get_ports {Signal_Noise[12]}] [get_ports {Signal_Noise[11]}] [get_ports {Signal_Noise[10]}] [get_ports {Signal_Noise[9]}] [get_ports {Signal_Noise[8]}] [get_ports {Signal_Noise[7]}] [get_ports {Signal_Noise[6]}] [get_ports {Signal_Noise[5]}] [get_ports {Signal_Noise[4]}] [get_ports {Signal_Noise[3]}] [get_ports {Signal_Noise[2]}] [get_ports {Signal_Noise[1]}] [get_ports {Signal_Noise[0]}] [get_ports SI] [get_ports SE] [get_ports test_mode] [get_ports scan_clk] [get_ports scan_rst]]
group_path -name REGOUT  -to [list [get_ports {Fliter_Signal[15]}] [get_ports {Fliter_Signal[14]}] [get_ports {Fliter_Signal[13]}] [get_ports {Fliter_Signal[12]}] [get_ports {Fliter_Signal[11]}] [get_ports {Fliter_Signal[10]}] [get_ports {Fliter_Signal[9]}] [get_ports {Fliter_Signal[8]}] [get_ports {Fliter_Signal[7]}] [get_ports {Fliter_Signal[6]}] [get_ports {Fliter_Signal[5]}] [get_ports {Fliter_Signal[4]}] [get_ports {Fliter_Signal[3]}] [get_ports {Fliter_Signal[2]}] [get_ports {Fliter_Signal[1]}] [get_ports {Fliter_Signal[0]}] [get_ports SO]]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[15]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[14]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[13]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[12]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[11]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[10]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[9]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[8]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[7]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[6]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[5]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[4]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[3]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[2]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[1]}]
set_input_delay -clock CLK  30  [get_ports {Signal_Noise[0]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[15]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[14]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[13]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[12]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[11]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[10]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[9]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[8]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[7]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[6]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[5]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[4]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[3]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[2]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[1]}]
set_output_delay -clock CLK  30  [get_ports {Fliter_Signal[0]}]


set_case_analysis 0 [get_port test_mode] 
set_case_analysis 0 [get_port SE]
